"""
Ստորև պատկերված աղյուսակը կոչվում է Պասկալի եռանկյունի (Pascal’striangle)
                    1
                1       1
            1       2       1
        1       3       3       1
    1       4       6       4       1
1       5       10      10      5       1
Եռանկյան կողմերում գտնվող բոլոր թվերը հավասար են 1-ի, իսկ եռանկյան
ներսում գտնվող թվերից յուրաքանչյուրը հավասար է նրա վերևի երկու թվերի
գումարին։ Գրեք ռեկուրսիվ ֆունկցիա, որը հաշվում է Պասկալի եռանկյունու
անդամի արժեքը։
"""

#   Ֆունկցիայի կիառումը՝ paskal(տող, սյունակ) սյունակը չպետք է գերազանցի տողը
def paskal(row, col):
    if 1 in [row, col] or row == col:
        return 1
    return paskal(row - 1, col - 1) + paskal(row - 1, col)

    # Տեռռար օպերատորով լուծում
    # return 1 if 1 in [row, col] or row == col else paskal(row - 1, col - 1) + paskal(row - 1, col)

#   Ֆունկցիա n բարձրության պասկալի եռանկյունի տպելու համար (հաշվարկումը վերևի ռեկուրսիվ ֆունկցիայով)
def print_paskal(n):
    for i in range(0,n + 1):
        print((n - i)*"  ", end="")
        for k in range(0, i):
            print(paskal(i, k + 1), end="   ")
        print()

print_paskal(7)
